xml/request/resend.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openorder">
   <soapenv:Header/>
   <soapenv:Body>
      <open:resendRequest>
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <open:messageType>?</open:messageType>
         <open:orderId>?</open:orderId>
         <open:requesterId>?</open:requesterId>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
         <!--Optional:-->
         <open:callback>?</open:callback>
      </open:resendRequest>
   </soapenv:Body>
</soapenv:Envelope>
