xml/request/answer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openorder">
   <soapenv:Header/>
   <soapenv:Body>
      <open:answerRequest>
         <!--Optional:-->
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <!--Optional:-->
         <open:expectedDelivery>?</open:expectedDelivery>
         <!--Optional:-->
         <open:latestProviderNote>?</open:latestProviderNote>
         <open:orderId>?</open:orderId>
         <open:providerAnswer>?</open:providerAnswer>
         <open:providerAnswerDate>?</open:providerAnswerDate>
         <open:providerAnswerReason>?</open:providerAnswerReason>
         <open:providerOrderState>?</open:providerOrderState>
         <open:requesterId>?</open:requesterId>
         <open:responderId>?</open:responderId>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
         <!--Optional:-->
         <open:callback>?</open:callback>
      </open:answerRequest>
   </soapenv:Body>
</soapenv:Envelope>
