xml/request/updateOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openorder">
   <soapenv:Header/>
   <soapenv:Body>
      <open:updateOrderRequest>
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <open:orderId>?</open:orderId>
         <open:requesterId>?</open:requesterId>
         <open:responderId>?</open:responderId>
         <open:forwardOrderId>?</open:forwardOrderId>
         <open:closed>?</open:closed>
         <open:providerOrderState>?</open:providerOrderState>
         <open:requesterOrderState>?</open:requesterOrderState>
         <open:serviceRequester>?</open:serviceRequester>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
         <!--Optional:-->
         <open:callback>?</open:callback>
      </open:updateOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>
