xml/request/checkelectronicdelivery.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openorder">
   <soapenv:Header/>
   <soapenv:Body>
      <open:checkElectronicDeliveryRequest>
         <!--Optional:-->
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <!--You have a CHOICE of the next 2 items at this level-->
         <open:bibliographicRecordId>?</open:bibliographicRecordId>
         <open:bibliographicRecordAgencyId>?</open:bibliographicRecordAgencyId>
         <open:pid>?</open:pid>
         <!--Optional:-->
         <open:serviceRequester>?</open:serviceRequester>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
         <!--Optional:-->
         <open:callback>?</open:callback>
      </open:checkElectronicDeliveryRequest>
   </soapenv:Body>
</soapenv:Envelope>
